# YOLOv26 🚀, AGPL-3.0 license
# YOLOv26 Triple Input + DINOv3 Dual Integration (P0 + P3)
# Backbone/head structure mirrors official yolo26.yaml exactly
# DINOv3 used at both P0 input stage and P3 mid-backbone stage

# Parameters
nc: 80        # number of classes
ch: 9         # input channels for triple input (3 RGB images concatenated)
end2end: True
reg_max: 1    # DFL bins
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# DINOv3 configuration
dinov3:
  model_size: "base"
  freeze: true
  output_channels: 64
  image_size: 224

# YOLOv26-triple backbone (DINOv3 ทั้ง P0 และ P3)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOv3Backbone, ["facebook/dinov3-vitb16-pretrain-lvd1689m", 9, 64, true]]   # 0-P0 DINOv3
  - [-1, 1, Conv,   [128, 3, 2]]               # 1-P2/4
  - [-1, 2, C3k2,   [256, False, 0.25]]        # 2
  - [-1, 1, Conv,   [256, 3, 2]]               # 3-P3/8
  - [-1, 2, C3k2,   [512, False, 0.25]]        # 4-P3 stage
  - [-1, 1, DINOv3Backbone, ["facebook/dinov3-vitb16-pretrain-lvd1689m", 512, 256, true]] # 5-P3 DINOv3
  - [-1, 1, Conv,   [512, 3, 2]]               # 6-P4/16
  - [-1, 2, C3k2,   [512, True]]               # 7
  - [-1, 1, Conv,   [1024, 3, 2]]              # 8-P5/32
  - [-1, 2, C3k2,   [1024, True]]              # 9
  - [-1, 1, SPPF,   [1024, 5]]                  # 10
  - [-1, 2, C2PSA,  [1024]]                    # 11

# YOLOv26-triple head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
  - [[-1, 7], 1, Concat, [1]]                     # 13  cat backbone P4
  - [-1, 2, C3k2, [512, True]]                    # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 15
  - [[-1, 5], 1, Concat, [1]]                     # 16  cat P3 DINOv3 enhanced
  - [-1, 2, C3k2, [256, True]]                    # 17  P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                    # 18
  - [[-1, 14], 1, Concat, [1]]                    # 19  cat head P4
  - [-1, 2, C3k2, [512, True]]                    # 20  P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                    # 21
  - [[-1, 11], 1, Concat, [1]]                    # 22  cat head P5
  - [-1, 1, C3k2, [1024, True]]                   # 23  P5/32-large

  - [[17, 20, 23], 1, Detect, [nc]]               # Detect(P3, P4, P5)
