# YOLOv26 🚀, AGPL-3.0 license
# YOLOv26 Triple Input + DINOv3 (P0 stage) object detection model
# Backbone/head structure mirrors official yolo26.yaml exactly
# DINOv3 replaces TripleInputConv at P0 for richer feature extraction

# Parameters
nc: 80        # number of classes
ch: 9         # input channels for triple input (3 RGB images concatenated)
end2end: True
reg_max: 1    # DFL bins
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# DINOv3 configuration
dinov3:
  model_size: "base"
  freeze: true
  output_channels: 64
  image_size: 224

# YOLOv26-triple backbone (DINOv3 แทน TripleInputConv ที่ P0)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOv3Backbone, ["facebook/dinov3-vitb16-pretrain-lvd1689m", 9, 64, true]]  # 0-P0 DINOv3
  - [-1, 1, Conv,   [128, 3, 2]]              # 1-P2/4
  - [-1, 2, C3k2,   [256, False, 0.25]]       # 2
  - [-1, 1, Conv,   [256, 3, 2]]              # 3-P3/8
  - [-1, 2, C3k2,   [512, False, 0.25]]       # 4
  - [-1, 1, Conv,   [512, 3, 2]]              # 5-P4/16
  - [-1, 2, C3k2,   [512, True]]              # 6
  - [-1, 1, Conv,   [1024, 3, 2]]             # 7-P5/32
  - [-1, 2, C3k2,   [1024, True]]             # 8
  - [-1, 1, SPPF,   [1024, 5]]                 # 9
  - [-1, 2, C2PSA,  [1024]]                   # 10

# YOLOv26-triple head (เหมือน yolo26.yaml ทุกอย่าง)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 11
  - [[-1, 6], 1, Concat, [1]]                     # 12  cat backbone P4
  - [-1, 2, C3k2, [512, True]]                    # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15  cat backbone P3
  - [-1, 2, C3k2, [256, True]]                    # 16  P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                    # 17
  - [[-1, 13], 1, Concat, [1]]                    # 18  cat head P4
  - [-1, 2, C3k2, [512, True]]                    # 19  P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                    # 20
  - [[-1, 10], 1, Concat, [1]]                    # 21  cat head P5
  - [-1, 1, C3k2, [1024, True]]                   # 22  P5/32-large

  - [[16, 19, 22], 1, Detect, [nc]]               # Detect(P3, P4, P5)
